package data

var TestData = []string{
	`Back-end Developer (PHP+Go)
	We seek a Middle Back-end Developer to join our new project - B2B solution to launch a trading platform.

	Requirements:
	✔️3+ commercial experience with PHP (framework: Laravel)
	✔️Practical knowledge of Golang
	✔️SOLID, Design patterns
	✔️Knowledge of Docker and Kubernetes
	
	Personality Profile:
	✔️ Thrives in environments with high levels of autonomy.
	✔️ Passionate about the dynamic and fast-paced startup atmosphere.
	✔️ Enjoys building and contributing, driven to achieve tangible results.
	✔️ Demonstrates outstanding problem-solving and analytical abilities.
	✔️ Self-reliant and eager for continuous learning, actively sharing knowledge and best practices.
	✔️ Ability to work collaboratively in a fast-paced and dynamic team environment.
	✔️ Excellent communication and documentation skills.
	
	Main responsibilities:
	✔️Developing and maintaining the back-end of web applications.
	✔️Writing clean, efficient, and well-documented code that adheres to industry best
	practices.
	✔️Participating in code reviews and contributing to the development of coding standards.
	✔️Ensuring the application is scalable, reliable, and performs well under high traffic.
	✔️Keeping up-to-date with emerging technologies, frameworks, and tools to ensure the application stays competitive.
	✔️Collaborating with cross-functional teams, including product managers and quality assurance, to deliver quality software products that meet business needs.
	
	We offer:
	✔️The opportunity to constantly develop professional skills;
	✔️Regular performance reviews;
	✔️Team building and English classes;
	✔️21 vacation days and 7 sick leaves without a doctor's note per year;
	✔️Gym compensation after 6 months of continuous work with us;
	✔️Medical insurance after 1 year of continuous work with us;
	✔️Corporate merch.
	
	We're seeking mindful players with an entrepreneurial mindset. And once we find them, we're committed to standing by their side, no matter what.
	
	We value people before their positions. Their passions can change and evolve, and we always find the best way to align with their new energy.
	
	Growth is Our #1 Priority. Work is personal. Personal means growth. Growth leads to prosperity.
	__________________________
	If this feels like a match for you, drop us a message, and we'll take it from there (don’t forget to attach your CV :).
	
	Even if the position only partially feels like you but you share the same values and vibe, get in touch anyway. We can figure something out.
	`,
	`Go Developer
	JOB OVERVIEW
	Aumify provides clients with the opportunity to create wealth by employing new technologies and the best trading strategies in crypto. And we are looking for a Golang Software Engineer to work on our own products.
	
	Requirements\ experience :
	2+ years experience Go programming language;
	Experience of development and successful launch of high load projects;
	Understanding of fundamental design principles behind a scalable application;
	Understanding of fundamental designs of OOP, SOLID;
	Strong skills: PostgreSQL/Gorm/Nats
	English level: A2-B1;
	As a plus:
	Interest in Blockchain technologies
	
	ABOUT THE COMPANY
	Aumify offers a cryptocurrency trading platform that is easy to use and provides specialized software for the crypto trading industry. Our aim is to enable all users to become successful cryptocurrency traders by utilizing our transparent and personalized platform. AIVIA provides a range of features and tools, making trading blockchain assets more convenient compared to traditional exchanges.
	Про компанію AIVIA
	AIVIA is a simple and easy-to-use platform for social trading, aka copy trading. This platform allows the novice user of cryptocurrency to follow the proven trading strategies of professional and seasoned traders. Registration is free, and users can get their feet wet in cryptocurrency trading within minutes. Funds are in their custody with theirexchange account. Here is how it works. Traders are placing orders in their accounts, and the same orders are placed in followers’ accounts using our platform by employing technology with API key integrations.
	For social media influencers, professional traders, trading signals developers, asset managers, large marketing organizations, or any other entities, we developed a white-label solution based on our technology. Detailed information is available on the website AuM.expert.
	`,
	`Back-end Engineer (Go)
	SKELAR — це venture builder, який будує міжнародні продуктові IT-компанії за правилами світу венчурних інвестицій. Разом із ко-фаундерами збираємо сильні команди, щоб запускати продуктові IT-бізнеси та перемагати на глобальних ринках.

	Зараз ми в пошуку Middle Back-end Engineer (Go)
	
	Howly — маркетплейс професійних онлайн-консультацій. Ми плануємо зробити революцію у галузі онлайн-консультацій та стати персональним кишеньковим експертом. Howly надає швидкі, персоналізовані та доступні відповіді на питання користувачів, а для експертів — створює можливість ефективно застосовувати свої знання, досвід та час.
	
	Cтек технологій: skelar-tech.github.io/Howly
	
	Які виклики чекають:
	— продумувати реалізацію продуктових вимог та втілювати їх у життя;
	— покривати свій код тестами та забезпечувати якість функціоналу;
	— деплоїти свій код на production та допомагати моніторити роботу системи;
	— закривати технічні задачі разом з тех. лідом.
	
	Що для нас важливо:
	комерційний досвід з:
	— Go;
	— ООП (базові принципи, SOLID, GoF patterns, Clean code);
	— Реляційною СУБД (PostgreSQL, MySQL, etc.);
	— Чергами (Kafka, RabbitMQ, etc.);
	— Написанням тестів (unit, integration);
	— Мікросервісною архітектурою;
	— Docker.
	
	Буде перевагою:
	— Вміння аналізувати логи, користуватись системами моніторингу;
	— Досвід роботи з gRPC або Apache Thrift;
	— Досвід з практиками: Test-driven Development (TDD), Behavior-driven development (BDD);
	— Розуміння, а ще краще практичний досвід з Domain-driven Design (DDD);
	— Розуміння як працює Kubernetes;
	— Розуміння як працює CI/CD.
	
	Окрім бізнесів, ми маємо Благодійний фонд SKELAR, який допомагає із забезпеченням українських захисників та захисниць амуніцією та технікою, а також підтримує зовнішні military-проєкти.SKELAR — середовище для самореалізації людей, які здатні створити успішні компанії. Ми такі компанії називаємо the next big everything. Віримо в їх потужність та масштаб.
	
	Ми плануємо й надалі розвивати tech-бізнеси, підкорювати глобальні ринки та працювати задля перемоги України 🇺🇦
	
	Для цього створили всі можливості всередині нашого venture builder’a:
	— 8 інфраструктурних команд, які допомагають стартапам закривати будь-які питання: від рекрутингу до фінансів та юридичних питань;
	— Спільнота фаундерів, які вже запустили не один бізнес й можуть ділитися практичним досвідом;
	— Внутрішні клуби за професійними напрямками: маркетинг, розробка, фінанси, рекрутинг;
	— Тренінги, курси, відвідування конференцій;
	— Медичне страхування, корпоративний лікар та психолог.
	
	Давай разом будувати the next big everything!
	Про компанію SKELAR
	SKELAR — це venture builder, який будує міжнародні IT-компанії за правилами світу венчурних інвестицій. Разом із нашими ко-фаундерами збираємо сильні команди, щоб запускати tech-бізнеси та перемагати на глобальних ринках.
	
	Сьогодні в SKELAR — десяток бізнесів у різних нішах, що мають відзнаки від Product Hunt, потрапляють у рейтинги ТОП-стартапів та продуктових компаній України, займають найвищі сходинки в AppStore та розробляють платформи, якими користуються мільйони людей.
	
	Наша місія: надавати high-перформерам можливості будувати компанії, які змінять tech-індустрію.
	
	Окрім бізнесів ми розвиваємо власний благодійний фонд SKELAR foundation на підтримку ЗСУ. В межах ініціативи створюємо та фінансуємо великі проєкти, що допомагають наближати нашу перемогу.
	
	SKELAR — середовище для самореалізації людей, які здатні створити успішні компанії. Ми такі компанії називаємо the next big everything. Віримо в їх потужність та масштаб.
	
	Ми плануємо й надалі розвивати tech-бізнеси, підкорювати глобальні ринки та працювати задля перемоги України:
	Для цього створили всі можливості всередині нашого venture builder’a:
	— 8 інфраструктурних команд, які допомагають стартапам закривати будь-які питання: від рекрутингу до фінансів та юридичних питань;
	— Спільнота фаундерів, які вже запустили не один бізнес й можуть ділитися практичним досвідом;
	— Внутрішні клуби за професійними напрямками: маркетинг, розробка, фінанси, рекрутинг;
	— Тренінги, курси, відвідування конференцій;
	— Медичне страхування, корпоративний лікар та психолог.
	
	Давай разом будувати the next big everything!	
	`,
	`Go Developer
	Про проєкт
	Наш проєкт — це B2B бетінгова платформа, яка активно розвивається, націлена як на покриття внутрішніх продуктів компанії, так і на активне завоювання B2B ринку. Ми націлені стати провайдером даних спортивних подій №1 у світі.
	
	Наша система має сервісну архітектуру, та побудована використовуючі сучасні технології та методології розробки. Зараз це 100+ сервісів і ми активно розробляємо нові.
	
	Наш стек:
	Мови програмування: Go, PHP (Legacy services), NodeJS (Legacy services), Kotlin.
	СУБД: MongoDB, PostgreSQL, RabbitMQ, Kafka, Elasticsearch, Redis, Clickhouse.
	API: REST, GraphQL, Event-Bus, gRPC.
	SCRUM, jira, bitbucket.
	
	Обов’язки:
	Імплементація нового функціоналу на мові Go.
	Інтеграцій сторонніх сервісів та підтримка наявних.
	Доставка написаного коду в продакшен.
	Активна участь в обговоренні архітектури, підходів тощо.
	Підтримка працездатності системи - моніторинг, реагування на алерти тощо.
	Код рев'ю, обмін знаннями з командою.
	
	Вимоги:
	Обов'язковий досвід роботи
	Golang (webservers, concurrency) - від 2-х років
	SQL/NoSQL (indexes, transactions, replication)
	Service-Oriented Architecture
	
	Ключові навички:
	SOLID, GRASP, Clean architecture.
	Database optimization.
	Queue (RabbitMQ, Kafka etc).
	Highload (database: locks, сoncurrency, isolation level, replication).
	SOA/Microservices, REST API, event sourcing.
	
	Буде плюсом:
	Досвід роботи з РНР, NodeJS.
	DevOps, CI/CD, deploy strategies, k8s.
	
	Пропонуємо:
	Конкурентну заробітну плату.
	Медичне страхування (в Україні).
	Соц.пакет, 100% оплата відпусток та лікарняних.
	Комфортабельне робоче місце, всю необхідну техніку.
	Тімбілдинги та корпоративні івенти.
	Корпоративна англійська.
	
	Якщо Вам не відповіли протягом 3х днів, на жаль, Ви нам не підходите. Ми збережемо Ваше резюме, в разі відкриття релевантної вакансії зв'яжемось з Вами. У зв'язку з навантаженністю HR відділу, нема можливості оперативно відповісти на всі запити. Дякуємо за розуміння)
	`,
	`Senior Back-end Developer
	
	Ми шукаємо талановитого Senior Back-end Developer, який допоможе Mythical Games визначити майбутнє ігор на блокчейні.

	Ця роль в Mythical Games надає можливість Senior Back-end розробнику вивести свою кар'єру на новий рівень, приєднавшись до найцікавішої компанії ігрової індустрії, електронної комерції та блокчейну.
	
	Обов'язки:
	- Розробка та підтримка одного або декількох сервісів платформи;
	- Написання ефективного, масштабованого та багаторазового коду;
	- Виправлення помилок;
	- Перегляд та побудова архітектури високонавантаженого продукту.
	
	Вимоги та навички:
	- 5+ років досвіду Backend розробки;
	- 2+ роки досвіду роботи з мовою програмування Go;
	- Досвід роботи з Kafka, Redis, CockroachDB(PostgreSQL);
	- Досвід розробки та успішного запуску високонавантажених проектів;
	- Досвід роботи з мікросервісною архітектурою, виявлення сервісів;
	- Розуміння фундаментальних принципів проектування масштабованих додатків;
	- Розуміння фундаментальних конструкцій ООP, SOLID;
	- Навички написання модульних/інтеграційних тестів;
	- Досвід роботи з Docker, Kubernetes;
	- Вміння працювати з нестандартними проблемами.
	
	Буде плюсом:
	- Інтерес до ігрової індустрії;
	- Досвід роботи з Rust - знання типів, макросів, скриптів, таргетів; досвід із Substrate буде великою перевагою;
	- Досвід performance-oriented програмування - структури даних, кеші, профілювання;
	- Досвід роботи з Helm.
	
	Місцезнаходження:
	Україна; віддалений формат роботи
	
	Процес найму:
	✅Прескрін з рекрутером → ✅Технічна співбесіда → ✅Фінальна співбесіда → ✅Збір рекомендацій → ✅Оффер
	
	Що ми пропонуємо:
	- Команду професіоналів-однодумців, які розділяють твою ігрову пристрасть;
	- Роботу в міжнародній продуктовій компанії - Mythical Games, яка є резидентом Дія.City;
	- Конкурентну фінансову винагороду;
	- Медичне страхування з перших робочих днів;
	- 22 дні оплачуваної відпустки, оплачувані лікарняні та інші особисті дні відповідно до внутрішніх політик компанії;
	- Гнучкий графік;
	- Реферальна програма;
	- Опціонна програма.
	
	Про нас: Mythical Games - венчурна компанія нового покоління ігрових технологій, яка працює на перетині відеоігор та економіки під керівництвом досвідчених професіоналів. Наша мета - стати лідером галузі, забезпечивши винятковий досвід роботи з відеоіграми на основі blockchain технологій, а також надати платформу надійних та зручних інструментів, що дозволять будь-яким розробникам ігор робити те саме.
	
	Про проект: Mythical Marketplace - це внутрішньоігровий онлайн ринок, де гравці можуть переглядати, купувати або продавати цифрові активи в мережі Mythical.
	
	Маркетплейс розкриває цінність грошових і часових зусиль гравця, а також унікальність їхніх колекцій, дозволяючи покупцям і продавцям впевнено здійснювати транзакції в безпечному і надійному середовищі.
	
	Інструменти Mythical Marketplace забезпечують безперешкодну інтеграцію з ігровим інвентарем, захист від шахрайства, оптимізацію комісій, надають рекомендації щодо ціноутворення для покупців і продавців, а також дозволяють обмінювати активи на фіатні гроші, криптовалюту тощо.
	Про компанію DMarket (acquired by Mythical Games)
	DMarket стає Games! Приєднуйтесь до нас!
	
	DMarket — український стартап, який виріс у велику міжнародну компанію з офісами в Лісабоні, Лондоні, Лос-Анджелесі, Сіетлі та Києві. Після нещодавнього придбання студією ігрових технологій нового покоління Mythical Games, DMarket став частиною передової гейм-компанії.
	
	У Mythical Games, і особливо в нашій українсько-португальській команді Mythical East, ми пишаємося нашою культурою «Люди перш за все». Ми віримо, що для створення чудових продуктів потрібні чудові люди та виключна корпоративна культура. Ставлячись один до одного з емпатією та повагою, підтримуючи ідеї і таланти один одного, ми живемо повноцінним життям поза роботою, створюючи при цьому виняткові продукти.
	
	Ми запрошуємо вас приєднатися до нашої дружньої сім’ї Mythical Games та підкорювати цей світ разом. Якщо ви захоплюєтесь блокчейн технологіями, штучним інтелектом, поняття метавсесвіт та web 3.0 для вас не просто красиві модні слова, ви надихаєтесь новими технологіями — вам точно до нас. Наша команда високопрофесійних експертів своїх напрямків завжди рада новим ідеям.
	
	Поспішіть застрибнути в космічний корабель Mythical Games. Відкриваймо нові горизонти разом!
	
	`,
	`Middle Go Engineer (продукт RozetkaPay)

	Про проєкт:
	EVO Fintech створює та об’єднує продукти у рішення під брендом RozetkaPay, які повʼязують онлайн оплати в інтернет, оплати в касах (карткою та готівкою), а також переказами з картки на картку.
	До того, ж рішення щодо дистанційної верифікації та ідентифікації партнерів для подальшого підписання з ними договорів з переказу коштів для забезпечення прийому оплат за замовлення з маркетплейсів.
	
	RozetkaPay вже використовують Rozetka, Prom, Vchasno, Bigl, Shafa, HelpVolunteer, Vodafone, Robota та інші.
	
	Технологічний стек:
	Golang 1.22+, gorm, temporal, gin;
	Postgresql, Redis, RabbitMQ;
	GCP, Kubernetes, Docker, GitLab CI, Argo CD, ElasticSearch/OpenSearch, Kibana, Grafana
	та будь-яка технологія, яку команда визнає за потрібну для використання
	
	Нам дуже важливі якість і гнучкість, тому ми використовуємо:
	- Мікросервісний підхід до розробки.
	- Обов’язковий етап код рев’ю.
	- Покриття тестами та метриками.
	- Відповідність стандартам якості коду.
	- Супровід та відповідальність за функціонал після впровадження в робоче середовище.
	- Взаємна повага і якісна відкрита комунікація.
	
	Що важливо для даної ролі:
	2+ року використання golang;
	- досвід конкурентного програмування на будь-якій мові — -важливе розуміння, які є підходи, і навіщо це потрібно в цілому;
	- досвід використання будь-яких SQL та NoSQL рішень, і розуміння причин використання кожного в конкретному випадку (наприклад, чому MongoDB замість Postgres, або чому Postgres замість Cassandra);
	- досвід профілювання додатків, використання метрик + досвід усунення “performance bottleneck”;
	- впевнені аналітичні здібності — необхідно буде не просто робити фічі за описом, але продумувати функціонал, починаючи від неформалізованих вимог, вибирати найбільш відповідне рішення і реалізовувати його;
	- вміння взаємодіяти в команді — не просто абстрактне “team player” а реальне вміння (досвід) знаходити компроміс в спірних моментах, і завжди бути відкритим до обговорення.
	
	Задачі:
	Розробка та подальша підтримка компонентів системи що реалізують чи забезпечують наступний функціонал:
	- транзакційний процесинг (платіжні флоу та ін.);
	- інтеграції з банківськими API та платіжними сервісами;
	- розробка та інтеграція із внутрішніми “data”-сервісами, що збагачують транзакцію;
	- автоматизація систем управління тарифами, сутностями та іншими; артефактами продуктової екосистеми.
	
	Етапи відбору:
	1. Знайомство з рекрутером та техлідом
	2. Технічне інтервʼю з інженерами проєкту
	3. Фінальне інтерв’ю з Head of Product та СТО EVO Fintech
	
	Ми пропонуємо:
	Офіційне працевлаштування у штат компанії
	24 календарних дні оплачуваної відпустки на рік, необмежена кількість лікарняних.
	Віддалена робота. Можливість відвідувати офіс у м.Київ
	Медичне страхування
	Послуги корпоративного психолога.
	Про компанію EVO
	EVO — продуктова українська IT-компанія. Центральний офіс знаходиться в Україні (м.Київ). 900+ співробітників, технічний департамент понад 300 осіб, розробників понад 200 осіб. Ми працюємо віддалено та в гібридному форматі.
	
	Місія EVO — створювати можливості для розвитку підприємництва. Ми робимо маркетплейси для онлайн-шопінгу і замовлення послуг — Prom.ua, Satu.kz, Bigl.ua, Kabanchik.ua, Shafa.ua. Також розвиваємо фінтех (проєкт RozetkaPay) та логістику.
	
	Активно розвиваємо кілька волонтерських проєктів:
	- платформа для безпечної волонтерської співпраці — Pidmoha. Вона згуртовує в одному місці волонтерів та організації, які потребують допомоги або готові допомогти у різних категоріях: медична, допомога тваринам, військова, транспорт, житло та гуманітарна допомога;
	- платформа для донатів HelpVolunteer. Тут запускаються збори на волонтерські потреби для наших захисників і всіх українців.
	
	Щомісяця, на маркетплейсах EVO люди роблять більш 2 млн замовлень. Кожен другий інтернет-покупець України купує на наших майданчиках.
	
	Про технічний департамент EVO:
	Основні мови програмування, які ми використовуємо це Python 3, JS / TS, Golang. Є проекти на Rust, Scala, Kotlin.
	
	Стандартна база даних для наших проектів - PostgreSQL, також використовуємо Redis, MongoDB.
	Для пошуку використовуємо ElasticSearch. Під вирішення окремих завдань існують свої плагіни. Працюємо з Clickhouse. В якості черг повідомлень RabbitMQ або Kafka.
	SPA програми будуємо здебільшого на. Для складання JS модулів використовуємо webpack, CSS стилі - CSS Modules.
	
	З інфраструктурних інструментів використовуємо:
	Gitlab, Docker, Kubernetes, Istio, Prometheus, Grafana, Kibana.
	Все, що потрібно для великого продакшн проекту: логінг (kibana), метрики, моніторинг (grafana)
	
	Стек мобільних технологій:
	Мови: Swift і Kotlin. Нові проекти пишемо на Flutter.
	
	Наш продакт інженерний підхід в EVO:
	Ми працюємо крос-функціональними командами до 10 осіб. Зазвичай, команда складається з продакт-менеджера, тімліда, розробників, тестувальників і дизайнерів. У деяких командах свої дата-аналітики, маркетологи та інші фахівці, які потрібні команді.
	Компанія продуктова, тому нам важливо щоб розробник був продуктово орієнтований. Це означає, що розробник не просто виконує поставлене завдання, а й розуміє проблеми бізнесу, які вирішує це завдання і може запропонувати більш оптимальне рішення, якщо таке існує, або показати, що ця задача не має цінності.
	
	Про технічне ком'юніті в EVO:
	- записуємо подкасти (слухати podcasts.google або тут apple podcasts)
	- організовуємо внутрішній dev-club (наші внутрішні конференції)
	- є свій open source (ось тут детальніше https://evo.company/product-development/)
	
	Сайт компанії:
	http://evo.company/
	
	Сторінка компанії на DOU:
	https://jobs.dou.ua/companies/evo/
	`,
	`Senior Go Developer (Advertising Platform)
	We invite a Senior Backend Developer to join an AdTech project and be responsible for turning our product vision and roadmap into best-in-class code that delivers an awesome customer experience. We need a person who can provide solutions that optimally balance development efforts, deployment costs, and time–to market while ensuring product requirements are met.

	This role requires a specialist with fully up-to-date knowledge of the latest software coding practices, tools, and languages.
	
	Ready to dive into this exciting project?
	
	PROJECT
	With the deprecation of cookies and mobile IDs, addressability at scale has become an industry-wide challenge. Working with partners with a future-proofed audience strategy and ID-less solution has become paramount, as has leveraging highly engaging and impactful creative to capture customers’ attention.
	
	While the client has traditionally focused on AI-powered audiences and geo-location, we are evolving with the industry to refocus on what truly matters in advertising and creativity. We leverage our powerful machine-learning engine to deliver high-scale, dynamic creatives that shine in a native environment. Contextually relevant ads show greater results.
	
	The software engineering team is the engine that drives our ambition to build the world’s best mobile advertising platform.
	
	Join us as we build future-proofed, AI-powered dynamic experiences for our customers.
	
	REQUIREMENTS
	Expert-level skills in Go
	Experience in container-based architectures (esp. Kubernetes/AWS)
	Hands-on experience in high performance, high scalability, high availability systems
	Ability to design and implement a main system capable of effectively multiplexing incoming requests into multiple outward connections (http/s, http2), while ensuring the maintenance of state until all outgoing requests receive replies
	Ability to organize software internally for optimal teamwork, including defining best development practices, environment setup, unit test definition, and test runtime setup and build automation
	Has experience in low-level socket management, timeouts, TCP keep alive, HTTP keep alive, timeouts, time wait states, and similar is highly valued
	Ability to diagnose Go language issues: internal metrics monitoring, defining the ideal metrics to monitor externally, debugging in isolation, profiling locally and in production
	Experience with CI/CD
	
	WOULD BE A PLUS:
	
	Experience with Node.js
	
	PERSONAL PROFILE:
	
	Strong analytical, problem-solving, and documentation skills
	Comfortable with working in Agile frameworks
	Experience working in distributed international teams
	Highly personable, with good communication skills
	
	RESPONSIBILITIES
	Design and implement large-scale software solutions and components using Golang
	Do everything needed to keep a high level of quality
	Be a great communicator to be able to actively collaborate and get context for complex tasks
	Follow best engineering practices and company/client guidelines
	Play supervisory, advisory, and coaching roles for less-senior engineers in the team
	Be an active contributor to all team-related meetings, events, and ceremonies
	Contribute to creating architectural and technical documentation
	Promote clean code and design patterns/principles
	Actively and permanently work on self-development and self-education, making lessons learned for further advancement to the Principal position.
	Про компанію Sigma Software
	Sigma Software is a place where Nordic Traditions meet Ukrainian Spirit to create Superior Software. We combine the best practices and approaches from Swedish and Ukrainian cultures. Taking high demand for quality, minimal hierarchy, freedom of decision-making, and attention to every opinion from Swedes, as a Ukrainian company we demonstrate flexibility and dedication to every project and every customer.
	
	We are IT consulting and software product company with development offices in Ukraine, Sweden, the USA, Canada, Poland, and Australia. We deliver smartest solutions to our customers in the areas of government, telecommunications, advertising, automotive, gaming, and others. Being a part of Sigma Group, one of the largest Nordic IT corporations, we are a global player with more than 5000 employees in 12 countries and over 1500 in Ukraine.
	
	We work with startups, software houses, and enterprises providing the products and services that suit our clients the most. Companys R&D centers are mastering the trending technologies and directions: Infotainment, AR/VR, Blockchain, Machine Learning, Data Science, Artificial Intelligence, and others.
	
	Сайт компанії:
	https://career.sigma.software/
	
	Сторінка компанії на DOU:
	https://jobs.dou.ua/companies/sigma-software/
	`,
	`Requirements:
 

    3+ years of experience in commercial software development 
    Working experience in Python, Java, Ruby, .Net, or other backend language
    Working  experience with MySQL, PostgreSQL, or other DBMS 
    REST API development experience
    Knowledge of software design patterns and the ability to apply them in the development process
    Solid understanding and practical experience with AWS services
    Experience with methods and tools such as Git
    At least an intermediate English level both written and verbal
    Fluent in Ukrainian language
    Ability to work independently and in a team
     

Will be a plus:

 

    Familiarity with React
    Familiarity with Golang
    Familiarity with server-to-server integrations
    Familiarity with GraphQL
     `,
	`Які виклики на тебе чекають:
	— допомагати команді розробників розгортати, експлуатувати та масштабувати додатки на Google Cloud Platform (GCP) та Kubernetes;
	— впроваджувати сучасну інфраструктуру як інструменти коду (IaC) (наприклад, Pulumi) та підходи до автоматизації забезпечення інфраструктури;
	— надавати технічну експертизу з усіх аспектів Kubernetes та технологій, пов'язаних з докером;
	— розробляти програми для покращення моніторингу та працездатності системи;
	— встановлювати, налаштовувати CI/CD;
	— керувати системами моніторингу за допомогою Grafana, Prometheus, VictoriaMetrics, Netdata та інших;
	— робота та вирішення проблем у кількох середовищах;
	— робота з сучасним технічним стеком;
	— робота над широким спектром хмарних проектів (проектування, будівництво, міграція, контейнеризація, модернізація хмар).
	
	Що для нас важливо:
	— 3+ років комерційного досвіду в DevOps, на GCP, AWS;
	— ОС Linux та досвід роботи з мережами;
	— досвід роботи з Kubernetes (istio, docker, containerd, helm, argocd);
	— досвід програмування на Go;
	— досвід управління конфігурацією (Ansible);
	— досвід архітектури, проектування, розробки та усунення несправностей великомасштабних складних систем;
	— жага щодня вивчати нові речі та працювати з передовими технологіями;
	— комерційний досвід роботи з такими технологіями як: Pulumi, Terraform, Ansible, GitLab, Prometheus monitoring, VictoriaMetrics, Grafana, Loki, NoSQL, RabbitMQ, ElasticSearch, Memcached;
	— cистематичний підхід до вирішення проблем у поєднанні з сильними комунікативними навичками та почуттям власності та драйву.`,
	`Насамперед ви зосередитеся на розробці мікросервісів на Go, які можна масштабувати та підтримувати. Для нас важливо: прагнення до спільного розв'язування проблем, продуманий дизайн і якісний продукт.

 

	Робота складається з розробки нових сервісів і функцій, рефакторингу старих сервісів, написання тестів.
	
	 
	
	Очікування від кандидата:
	
	 
	
	- від 1-го року професійного досвіду розробки програмного забезпечення
	
	- Знання мови програмування Go, парадигм, конструкцій та ідіом
	
	- Розуміння того, як основні структури даних реалізовані в Go
	
	- Написання модульних тестів
	
	- Розуміння основ роботи реляційних баз даних
	
	- Досвід роботи з: gRPC, GraphQL
	
	- Знайомство з інструментами CI / CD, такими як Jenkins, Gitlab pipelines
	
	- Розуміння Docker і Kubernetes
	
	- Захоплення спортом буде плюсом
	
	 
	
	Обов'язки:`,
	`
	Tech stack:
	Go, MongoDB Atlas, AWS, Lambda, Serverless
	3rd parties: Auth0, Sentry, HubSpot, PostHo
	
	English: Inter or higher
	
	We offer:
	
	- Cooperation with a stable company with well-established processes and a positive atmosphere
	
	- Experience in project management of different levels of complexity, methodology, and approaches
	
	- Flexible schedule: Mon-Fri (8 hours a day)
	
	- 18 days of paid vacation; 15 days sick leave
	
	- A decent level of remuneration with regular reviews of the results of cooperation
	
	- Corporate library for self-development
	
	- Extensive loyalty program`,
	`Requirements

	Mandatory
	
		Understanding of OOP and Design Patterns in one or more languages like: Go, Java, Python, or C/C++, with more than 3 years of proven, production-grade software development expertise
		Experience in developing RESTful backend services implementing APIs
		Good understanding of distributed systems and architecture
		Knowledge and experience (modelling and architecture) of SQL and relational databases (MySQL)
		Solid experience with Software Testing
	
		Experience in version control (Git preferably)
	
		 
	
	Nice to have:
	
		Experience with Go lang in production services will be highly appreciated
		Experience in Agile Methodologies (Scrum, Kanban)
		A DevOps mindset, Docker technology and containerization
		Experience in DDD
		Knowledge and experience of non-relational databases (one or more of MongoDB, Redis, ElasticSearch)
	
		Experience with any messaging system like AWS SQS, Apache Kafka, etc.`,
	`Responsibilities:

	● Developing the backend services of the CRM system from scratch.
	
	● Designing and implementing the logic for lead distribution.
	
	● Writing both unit and integration tests to ensure robustness and
	
	reliability of the system.
	
	● Influencing the system architecture and making technical decisions to
	
	improve the product.
	
	 
	
	Core Requirements:
	
	● Minimum 3 years of experience in development backend services in Go (or over 5 years of experience in another programming language with basic knowledge of Go and a willingness to advance in Golang)
	
	● Proficiency in both microservices architecture and monolithic structures, with the ability to develop, maintain, and, when necessary, break down monoliths into services.
	
	● Knowledge of high-load system development principles.
	
	● Experience in developing RESTful APIs.
	
	● Experience with database management systems (PostgreSQL/MySQL)
	
	and an understanding of database design and optimization principles.
	
	● Proficiency in Docker.
	
	● Knowledge and experience with HTTP/HTTPS and WebSockets
	
	protocols.
	
	 
	
	Desirable Skills:
	
	(Note: It's not mandatory to have all these skills, but the more you have, the better.)
	
	● Experience with message queuing systems (RabbitMQ).
	
	● Knowledge of main design patterns and their applications.
	
	● Familiarity with CI/CD processes and tools (Jenkins, GitLab CI/CD).
	
	● Experience with MongoDB.
	
	● Frontend development skills and JavaScript (NodeJS) knowledge will
	
	be considered a plus.
	
	 
	
	Nice to have: basic knowledge of NodeJS, MongoDB
	
	 
	
	Personal Qualities:
	
	● The ability to work effectively both as part of a team and independently.
	
	● An analytical mindset with a keen eye for detail.
	
	● A strong desire for professional learning and growth.
	
	● A responsible approach to task execution.
	
	 `,
	`What you'll do in this role  

 

    Design, develop, and maintain robust and scalable software solutions using the Go programming language.
    Collaborate with cross-functional teams to define, design, and ship new features.
    Write clean, efficient, and maintainable code following best practices.
    Troubleshoot and debug complex issues in existing systems.
    Optimize applications for maximum performance and scalability.
    Participate in code reviews to ensure code quality and adherence to coding standards.
    Stay up-to-date with the latest industry trends and technologies.


We're looking for

 

    3-5 years of general experience in the field.
    1-2 years of experience with the Go programming language.
    Strong knowledge of concurrency models and parallel computing.
    Experience with pointers and memory management.
    Experience with databases, writing SQL queries, and NoSQL.
    Knowledge of high availability applications, replication, and stateless applications.
    Experience with message queues and asynchronous programming.
    Familiarity with observability, logging, tracing, and alerting.
    Excellent English communication skills, at least upper-intermediate level.

 

How to knock our socks off

 

    Bachelor's degree in Computer Science, Engineering, or a related field.
    Experience with containerization technologies such as Docker and Kubernetes.
    Experience with microservices architecture.
    Knowledge of front-end technologies such as HTML, CSS, and JavaScript.
    Naming five or more dishes that include Beetroot, besides borshch ;)`,
	`• Development experience for Go 2+ years;
	• Time management and organizational skills;
	• Ability to design and implement scalable and reliable software solutions;
	• Excellent problem-solving skills;
	• Git, GitLab , GitLab CI;
	• Experience with multiple databases (RDMBS, NoSQL, SQL, Redis, ...) and messaging services (Kafka, NATS, ...), ideally run in a cloud (e.g. AWS);
	• Strong system design skills;
	• REST/RPC transports;
	• Practical knowledge of containers (Docker, Kubernetes);
	• Experience with micro-services design and development;
	• Understanding of the importance of well-organized codebase and documentation;
	
	 
	
	Responsibilities:
	
	• Participate in code reviews to ensure code quality and distribute knowledge;
	• Integrate renowned third-party services;
	• Write high-performance, testable, and maintainable code to implement new functionality;
	• Take part in technical discussions to come up with solutions for challenging issues;
	• Mentorship, knowledge sharing with team;
	
	 
	
	Will be plus:
	
	• Understanding event-driven architecture;
	• Understanding Twelve-Factor App methodology;
	• Cloud Events;
	• Working with cloud services GCP\AWS;
	• GitOps;
	• Terraform;
	• Helm\Argocd;
	• Grafana\Tempo\Loki + Prometheus;
	• High load systems;
	
	 `,
	`Requirements:

	At least 5 years of experience in developing server applications;
	
	Experience developing in Golang - A must;
	
	Experience in designing and implementing data-driven applications powered by both MySQL, PostgreSQL, and NoSQL (Redis, MongoDB) solutions;
	
	Experience optimising performance in SQL databases;
	
	Experience writing RESTful APIs and understanding the HTTP protocol;
	
	Experience working with Scrum / Agile development methodologies;
	
	Experience in writing unit and integration tests;
	
	Good English communication skills, both verbal and written;
	
	Understanding the business needs and providing optimal customer experience to our users.
	
	 
	
	Benefits:
	
	Private medical care (LuxMed Expanded package);
	
	Paid official national holidays (13 days per year);
	
	20 days of paid vacation per calendar year;
	
	Up to 10 days of sick leave is paid per calendar year.`,
	`Location: Remote (US Market).

	Working Hours: 7 AM to 4 PM CST.
	
	 
	
	Candidate Requirements:
	
		4+ years of commercial production experience in Golang development.
		Experience working with PostgreSQL, including stored procedures and triggers.
		Experience with messaging systems such as NATS (or similar, like Kafka).
		Experience in projects with microservice architecture, including both developing microservices and setting up and interacting with the infrastructure.
	
	 
	
	Preferred Qualifications:
	
		Experience with Vue 3.
		Experience with AWS.
	
	 
	
	Our Tech Stack:
	
		Core API Building: Golang.
		User Interface: Vue 3, Web socket RPC for real-time data, REST for API communication.
		Base Database: PostgreSQL, PostGis.
		Messaging Between Components: High-performance distributed system NATS.
		Infrastructure Management: Terraform, Ansible.
		Migration to CI/CD: CodeCommit, BitBucket, AWS Cloud.`,
	`Main Responsibilities

 

	– Your Mission. Design, develop and execute features from sketch to production that will have a huge business impact on the core products
	– High Impact. Ramp up the technical level of your team & cross-backend engineers
	– Own your mission. Develop high-priority projects to make the most scalable, high-velocity products on the market
	– Lead. As part of a team developing with a complex micro-services backend architecture, you’ll work with the team and lead us towards solutions for large-scale challenges
	– Dream Team. You’ll join an agile dev squad of engineers who are all highly talented, very collaborative and excited to hear your opinion
	
	 
	
	Mandatory Requirements
	
	 
	
	– 5+ years of experience building highly scalable, SaaS web products
	– Excellent problem-solving skills and the ability to work in a fast-paced, collaborative environment
	– Fluent in any programming languages such as Golang, Node.js, Python, Scala or similar
	– Experience with SQL and NoSQL databases, Docker, K8s/ECS/Nomad or similar, AWS or similar public cloud, ensuring data integrity and performance
	– Vast experience in microservices architecture, distributed systems & high scale environments
	– Experience with software development best practices, including design patterns, code review, testing and the principles of clean code
	– Ability to work independently and lead initiatives E2E
	– Excellent teamwork and communication skills`,
	`Sabai Friends is an ambitious young team in the GameFi industry, founded and funded by a successful multi-country resort property company headquartered in Phuket, Thailand.

 

	Our mission is to use gamification, educational processes and the construction of resort real estate to take care of family, loved ones, environment, nature, one's property, city/village, country, world, and future generations.
	
	 
	
	We are looking for a talented Golang developer for long-term part-time cooperation.
	
	 
	
	Your main goal will be to create a backend for our games - Sabai World Sabai Light. And further development and support.
	
	Daily responsibilities:
	
		Contribute to the architecture and design solutions considering various aspects like extensibility, scalability, performance, security, design patterns.
		Provide effort estimates for the requested functionalities.
		Delivery on time and commitments by the team.
		Design and implement unit tests.
		Participate in designing and developing the fault-tolerant, highly available, and optimized solutions.
		 
	
	Qualifications:
	
		2+ years with Go.
		Experience in backend developing for mobile games will be a plus.
		Good communication-and problem-solving skills.
		Strong teamwork spirit.`,
	`Requirements:

 

	✔️ Bachelor's degree in Computer Science, Engineering, or a related field.
	
	✔️ Minimum of 3 years of commercial experience as a Golang backend developer.
	
	✔️ Proven track record of at least 3 years of experience with Golang development.
	
	✔️ Strong understanding of high-load services and microservices architecture.
	
	✔️ Proficiency in SQL/NoSQL databases, with a preference for MongoDB.
	
	✔️ Experience with Redis for caching and optimizing system performance.
	
	✔️ Familiarity with message brokers like RabbitMQ/Kafka for asynchronous communication.
	
	✔️ Solid understanding of RESTful API design and implementation.
	
	✔️ Excellent problem-solving skills and ability to troubleshoot complex issues.
	
	✔️ Strong communication and collaboration skills, with the ability to work effectively in a team environment.
	
	✔️ Ability to adapt to a fast-paced and dynamic work environment.
	
	 
	
	Preferred Qualifications:
	
	 
	
	✔️ Experience with containerization technologies like Docker and orchestration tools like Kubernetes.
	
	✔️ Familiarity with cloud platforms such as AWS, GCP, or Azure.
	
	✔️ Knowledge of CI/CD pipelines and automated testing frameworks.
	
	✔️ Experience working in Agile/Scrum methodologies.
	
	 `,
	`We are building a large-scale and high-performance cloud-based networking service platform that will deliver the next generation of Internet services across private and public networks.

 

	Requirements:
	
	• 5+ years experience with high-scale, high-performance, and high-availability server development
	
	• 5+ years of programming experience in Go
	
	• Solid understanding of algorithm complexity, parallel/distributed systems, advanced data structures, computer networking, and operating systems
	
	• Development expertise in REST/SOAP/JSON API
	
	• Development expertise in message bus technologies such as RabbitMQ, ActiveMQ; Apache Kafka
	
	• Solid working knowledge of NoSQL – Cassandra
	
	 
	
	#Prefered:
	
	• Experience in programming with NodeJS or JavaScript
	
	 
	
	 
	
	Responsibilities:
	
	As a Lead Software Engineer, you will specialize in building high-performance, reliable back-end systems and server-side APIs, creating the interconnectivity fabric of the platform and enabling the provisioning of a new and revolutionary class of services to millions of Internet users.
	
	 
	
	• Migrating from NodeJS into Golang
	
	• Design and develop REST and messaging-based software infrastructure and build back-end systems and APIs
	
	• Design and develop low latency/high throughput server infrastructure components to handle large volumes of transactions
	
	• Design and develop utilities for performance tests.
	
	• Running performance tests and collecting data.
	
	• Analyze requirements, design and develop code, unit test code, and test tools
	
	• Present and defend architectural, design, and technical choices to internal and external audiences.
	
	• Do code optimization.
	
	• Comfortable with collaboration, open communication, and reaching across dev, qa, ops and other cross-functional teams
	
	• Create documentation of performance test results.
	
	 `,
	`

	✔Position: Golang Developer
	
	✔Place of work: Remote
	
	✔Project: launched in 2018.
	
	Goal: production of stablecoins backed by gold or other stable assets. The crypto product owned by the company is hosted on its own blockchain platform, while many other cryptocurrencies are hosted on others.
	
	✔ Required skills:
	
	- 5+ years of experience with Golang;
	
	- 2+ years of experience with Cosmos SDK;
	
	- experience in writing smart contracts for CosmWasm;
	
	- technical English
	
	✔ Company offers:
	
	- We are a product company, we are not a “gallery” In most companies, everything depends on customers and employees constantly switch from project to project. We do not depend on other people's orders and make our own products that are used in 86 countries;
	
	- work in a friendly team;
	
	- paid vacation of 20 (working) days;
	
	- holidays according to the state calendar of Ukraine;
	
	- we have no bureaucracy, which is typical for many companies.
	`,
	`

	Our culture isn't something employees join, it's something they build and shape. We believe that every person deserves to be heard and empowered. If you're on the fence about whether you're a fit, we say go for it. Let’s build something great together.
	
	 
	
	Must Haves:
	
		5+ years of professional experience in building web applications.
		A full-stack mindset to work across the front-end, back-end, and AWS cloud.
		Strong experience with Golang and Node.js/JavaScript.
		Practical experience building data structures and data sources for various data types.
		Expertise in AWS microservice development.
		Excellent communication skills and strong product focus.
		Upper-Intermediate or above English level.
		 
	
	Key Responsibilities:
	
		Architect, build and test IoT microservices to support APIs, MQTT topics, and business logic.
		Architect, build, and test data structures to support telemetry, usage, and business data.
		Provide support for the software architecture, design, and implementation of software components related to our IoT-connected products.
		Design and architect data storage by balancing performance, cost, and storage tradeoffs through various database technologies.
		Evaluate security best practices, trends, and models to identify and recommend appropriate solutions for connected products to meet stringent requirements.
		Develop efficient and compact software to balance tradeoffs spanning the cloud, device firmware, connected apps, and other backend systems.
		Actively contribute to and support challenging software implementations by creating the critical code foundation on which other team members can build.
	
	`,
	`Today, they partner with more than 1,000 top-tier publishers (including Wall Street Journal, New York Times, News Corp, Verizon Media, CBS, Fox News, Hearst, Refinery 29, and more) and host 100 million monthly active users.

 

	They are empowering individuals to take action and demand more from one another. Crafting technology that naturally brings people together and fosters healthy discussion—so they have more dinner-table talks and less shouting matches online.
	
	 
	
	What You'll Do:
	
	- Your Mission. Design, develop and execute features from sketch to production that will have a huge business impact on the core products at OpenWeb.
	
	- High Impact. Ramp up the technical level of your team & cross-backend engineers
	
	- Own your mission. Develop high-priority projects to make the most scalable, high-velocity products on the market.
	
	- Lead. As part of a team developing with a complex micro-services backend architecture, you'll work with the team and lead us towards solutions for large-scale challenges.
	
	- Dream Team. You'll join an agile dev squad of engineers who are all highly talented, very collaborative and excited to hear your opinion.
	
	 
	
	The Skills and Experience You Bring:
	
	- 5+ years of experience building highly scalable, SaaS web products.
	
	- Excellent problem-solving skills and the ability to work in a fast-paced, collaborative environment.
	
	- Fluent in any programming languages such as Golang, Node.js, Python, Scala or similar.
	
	- Experience with SQL and NoSQL databases, Docker, K8s/ECS/Nomad or similar, AWS or similar public cloud, ensuring data integrity and performance.
	
	- Vast experience in microservices architecture, distributed systems & high scale environments.
	
	- Experience with software development best practices, including design patterns, code review, testing and the principles of clean code.
	
	- Ability to work independently and lead initiatives E2E.
	
	- Excellent teamwork and communication skills.`,
}
